<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>FI PB138 SCXML2VoiceXMLJ</title><link rel="stylesheet" href="docbook.xml.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.75.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="cs" class="article" title="FI PB138 SCXML2VoiceXMLJ"><div class="titlepage"><div><div><h2 class="title"><a name="d0e1"></a>FI PB138 SCXML2VoiceXMLJ</h2></div><div><h3 class="subtitle"><i>Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</i></h3></div><div><div class="author"><h3 class="author"><span class="firstname">Petr</span> <span class="surname">Domka&#345;</span></h3></div></div></div><hr></div><div class="toc"><p><b>Obsah</b></p><dl><dt><span class="section"><a href="#d0e16">Organizace</a></span></dt><dt><span class="section"><a href="#d0e21">Testovac&iacute; data, testy</a></span></dt><dt><span class="section"><a href="#d0e26">Wiki str&aacute;nky</a></span></dt><dt><span class="section"><a href="#d0e31">Interpret</a></span></dt></dl></div><p>
        Na projektu jsem se p&#345;edev&#353;&iacute;m pod&iacute;lel na zaji&#353;t&#283;n&iacute; organizace v&yacute;voje aplikace pro p&#345;evod kone&#269;n&eacute;ho automatu popsan&eacute;ho pomoci SCXML na dialogovou strategii popsanou pomoci VoiceXML.
        To zahrnovalo nastudov&aacute;n&iacute; probl&eacute;mu zad&aacute;n&iacute;, navrhnut&iacute; mo&#382;n&eacute;ho proveden&iacute; a rozd&#283;len&iacute; aplikace na d&iacute;l&#269;&iacute; komponenty, kter&eacute; se dali vypracovat zvl&aacute;&#353;&#357; a n&aacute;sledn&aacute; komunikace ohledn&#283; aplikace. D&aacute;le jsem se v&#283;noval vytvo&#345;en&iacute; testovac&iacute;ch dat, test&#367;, wiki str&aacute;nek a hled&aacute;n&iacute; interpreta pro VoiceXML.
    </p><div class="section" title="Organizace"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e16"></a>Organizace</h2></div></div></div><p>V r&aacute;mci projektu jsem se v prvn&iacute; &#345;ad&#283; staral o jeho organizaci. To zahrnovalo komunikaci ohledn&#283; up&#345;esn&#283;n&iacute; zad&aacute;n&iacute; a hl&iacute;d&aacute;n&iacute; kontroln&iacute;ch bod&#367;. D&aacute;le jsem v r&aacute;mci organizace promyslel, jak by se aplikace dala rozd&#283;lit na n&#283;kolik komponent, na kter&yacute;ch by mohli jednotliv&#283; pracovat spolu&#382;&aacute;ci. Prvn&iacute; komponenta se postar&aacute; o komunikaci s u&#382;ivatelem, kontrolu vstup&#367; a n&aacute;sledn&#283; zajist&iacute; komunikaci mezi dal&#353;&iacute;mi dv&#283;mi komponentami. Vzhledem k tomu &#382;e vstupn&iacute; soubor SCXML, kter&yacute; reprezntuje mealyho automat, m&#367;&#382;e obsahovat n&#283;jakou gramatiku, bylo pot&#345;eba jednotliv&eacute; gramatiky vyseparatovat a &#345;&iacute;ct ke kter&yacute;m stav&#367;m pat&#345;&iacute;. Toto &#345;e&#353;ila druh&aacute; komponenta, kter&aacute; z&iacute;skan&eacute; data p&#345;edala pomoc&iacute; mapy Map&lt;stav, gramatika&gt; dal&#353;&iacute; komponent&#283;. T&#345;et&iacute; komponenta p&#345;evede vstup (Mealeyho automatu ve form&aacute;tu SCXML) do v&yacute;stupu v podob&#283; dialogov&eacute; strategie zapsan&eacute; pomoc&iacute; VoiceXML. Pot&#345;ebnou gramatiku ve form&#283; SRGS zajist&iacute; ji&#382; druh&aacute; komponenta.</p></div><div class="section" title="Testovac&iacute; data, testy"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e21"></a>Testovac&iacute; data, testy</h2></div></div></div><p>Pro v&yacute;voj aplikace jsme pot&#345;ebovali testovac&iacute; data pro p&#345;edstavu, jak data mohou vypadat a pro testov&aacute;n&iacute; aplikace. Pro toto jsem musel nastudovat specifikaci pro SCXML, SRGS a VoiceXML soubory a zjistit z jak&yacute;ch element&#367; se skl&aacute;daj&iacute;, kde budou p&#345;ed&aacute;v&aacute;na data a ur&#269;it rozmez&iacute; na&#353;&iacute; aplikace, co bude um&#283;t. D&aacute;le jsem vytvo&#345;il n&#283;kolik test&#367; pro automatick&eacute; testov&aacute;n&iacute; funk&#269;nosti projektu.</p></div><div class="section" title="Wiki str&aacute;nky"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e26"></a>Wiki str&aacute;nky</h2></div></div></div><p>Na za&#269;&aacute;tku zad&aacute;n&iacute; projekt&#367; jsem &#345;e&#353;il jakou mo&#382;nost zvolit pro vytvo&#345;en&iacute; wiki str&aacute;nek. Cht&#283;li jsme, aby se str&aacute;nka dala lehce upravovat online z prohl&iacute;&#382;e&#269;e. D&aacute;l&#353;&iacute;m po&#382;adavkem bylo, aby se nemuselo nic instalovat na server co&#382; nab&iacute;zelo v&#283;t&#353;ina web&#367;. Vyzkou&#353;el jsem tvorbu wiki na www.wikidot.com, kter&eacute; nebyli p&#345;ili&#353; u&#382;ivatelsky p&#345;&iacute;v&#283;tiv&eacute; narozd&iacute;l od wiki str&aacute;nek na www.github.com, kter&eacute; jsem nakonec zvolil pro wiki projektu. D&aacute;l&#353;&iacute; v&yacute;hodou bylo &#382;e jak k&oacute;d, tak wiki str&aacute;nky jsou na jednom m&iacute;st&#283;.</p></div><div class="section" title="Interpret"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e31"></a>Interpret</h2></div></div></div><p>Na&#353;e aplikace na v&yacute;stupu vr&aacute;t&iacute; soubor VoiceXML + gramatiku. Proto jsem v pr&#367;b&#283;hu projektu zkoumal a hledal, jak se d&aacute; v&yacute;stupn&iacute; soubor (.vxml) interpretovat pomoc&iacute; n&#283;jak&eacute;ho "robota", kter&yacute; vyu&#382;ije .vxml soubor pro komunikaci s u&#382;ivatelem.</p></div></div></body></html>